Repository: fricred/QRaft
Catalog: lib/l10n/app_*.arb
Languages: es

# welcomeTitle
source: Welcome to QRaft!
es: ¡Bienvenido a QRaft!

# welcomeSubtitle
source: Your complete solution for custom QR codes
es: Tu solución completa para QR personalizados

# featureCreateTitle
source: Create Custom QR
es: Crea QR personalizados

# featureCreateDescription
source: Design and customize your own QR codes for any purpose.
es: Diseña y personaliza tus propios códigos QR para cualquier propósito.

# featureShareTitle
source: Share Easily
es: Comparte fácilmente

# featureShareDescription
source: Send your QR codes to your contacts or publish them on your social networks.
es: Envía tus QR a tus contactos o publícalos en tus redes sociales.

# featureEngraveTitle
source: Engrave on Materials
es: Graba en materiales

# featureEngraveDescription
source: Get your QR codes engraved on wood, metal and other quality materials.
es: Obtén tus QR grabados en madera, metal y otros materiales de calidad.

source: Get Started
es: Comenzar

# alreadyHaveAccount
source: Already have an account? Sign In
es: ¿Ya tienes cuenta? Iniciar Sesión

source: Main Features
es: Características principales

source: Welcome Back
es: Bienvenido de Nuevo

# welcomeBackUser
source: Welcome back, {name}
es: Bienvenido de nuevo, {name}

# signInToContinue
source: Sign in to continue creating amazing QR codes
es: Inicia sesión para continuar creando códigos QR increíbles

source: Email
es: Correo Electrónico

# enterEmail
source: Enter your email
es: Ingresa tu correo electrónico

source: Password
es: Contraseña

# enterPassword
source: Enter your password
es: Ingresa tu contraseña

source: Forgot Password?
es: ¿Olvidaste tu Contraseña?

source: Sign In
es: Iniciar Sesión

# dontHaveAccount
source: Don't have an account? Sign Up
es: ¿No tienes cuenta? Regístrate

source: Create Account
es: Crear Cuenta

# joinQRaft
source: Join QRaft and start creating amazing QR codes
es: Únete a QRaft y comienza a crear códigos QR increíbles

source: Full Name
es: Nombre Completo

# enterFullName
source: Enter your full name
es: Ingresa tu nombre completo

# createPassword
source: Create a password
es: Crea una contraseña

source: Confirm Password
es: Confirmar Contraseña

# confirmPasswordHint
source: Confirm your password
es: Confirma tu contraseña

# agreeToTerms
source: I agree to the Terms & Conditions and Privacy Policy
es: Acepto los Términos y Condiciones y la Política de Privacidad

# alreadyHaveAccountSignIn
source: Already have an account? Sign In
es: ¿Ya tienes cuenta? Iniciar Sesión

# pleaseEnterEmail
source: Please enter your email
es: Por favor ingresa tu correo electrónico

# pleaseEnterValidEmail
source: Please enter a valid email
es: Por favor ingresa un correo electrónico válido

# pleaseEnterPassword
source: Please enter your password
es: Por favor ingresa tu contraseña

# passwordMinLength
source: Password must be at least 6 characters
es: La contraseña debe tener al menos 6 caracteres

# pleaseEnterName
source: Please enter your name
es: Por favor ingresa tu nombre

# nameMinLength
source: Name must be at least 2 characters
es: El nombre debe tener al menos 2 caracteres

# passwordMinLengthSignUp
source: Password must be at least 8 characters
es: La contraseña debe tener al menos 8 caracteres

# passwordMustContainUppercase
source: Password must contain at least one uppercase letter
es: La contraseña debe contener al menos una letra mayúscula

# passwordMustContainLowercase
source: Password must contain at least one lowercase letter
es: La contraseña debe contener al menos una letra minúscula

# passwordMustContainNumber
source: Password must contain at least one number
es: La contraseña debe contener al menos un número

# pleaseConfirmPassword
source: Please confirm your password
es: Por favor confirma tu contraseña

source: Passwords do not match
es: Las contraseñas no coinciden

# pleaseAgreeToTerms
source: Please agree to Terms & Conditions
es: Por favor acepta los Términos y Condiciones

# loginAttempt
source: Login attempt: {email}
es: Intento de inicio de sesión: {email}

# accountCreated
source: Account created for: {name}
es: Cuenta creada para: {name}

# forgotPasswordComingSoon
source: Forgot password functionality coming soon
es: La funcionalidad de recuperar contraseña estará disponible pronto

# loginSuccessful
source: Login successful! Welcome back.
es: ¡Inicio de sesión exitoso! Bienvenido de vuelta.

source: Reset Password
es: Restablecer Contraseña

# resetPasswordSubtitle
source: Enter your email to receive reset link
es: Ingresa tu email para recibir el enlace

# enterEmailForReset
source: Enter your email address
es: Ingresa tu dirección de email

# sendResetLink
source: Send
es: Enviar

source: Email Sent!
es: ¡Email Enviado!

# checkEmailForReset
source: We've sent a password reset link to {email}. Please check your email and follow the instructions to reset your password.
es: Hemos enviado un enlace de restablecimiento de contraseña a {email}. Por favor revisa tu email y sigue las instrucciones para restablecer tu contraseña.

source: Done
es: Listo

source: Profile
es: Perfil

source: Anonymous User
es: Usuario Anónimo

source: No email
es: Sin correo

source: Change Profile Photo
es: Cambiar Foto de Perfil

# choosePhotoSource
source: Choose how you want to update your profile photo
es: Elige cómo quieres actualizar tu foto de perfil

source: Updating profile photo...
es: Actualizando foto de perfil...

# profilePhotoUpdatedSuccess
source: Profile photo updated successfully!
es: ¡Foto de perfil actualizada con éxito!

# profilePhotoUpdateFailed
source: Failed to update profile photo. Please try again.
es: Error al actualizar la foto de perfil. Inténtalo de nuevo.

source: Joined {date}
es: Se unió {date}

source: Unknown
es: Desconocido

# daysAgo
source: {days} days ago
es: hace {days} días

# monthsAgo
source: {months} month{plural} ago
es: hace {months} mes{plural}

# yearsAgo
source: {years} year{plural} ago
es: hace {years} año{plural}

source: Personal Information
es: Información Personal

source: Display Name
es: Nombre Visible

source: Phone Number
es: Número de Teléfono

source: Bio
es: Biografía

source: Location
es: Ubicación

source: Website
es: Sitio Web

source: Company
es: Empresa

source: Job Title
es: Puesto de Trabajo

source: Enter {field}
es: Ingresa {field}

source: Not provided
es: No proporcionado

source: Statistics
es: Estadísticas

source: QR Codes
es: Códigos QR

source: Scans
es: Escaneos

source: Orders
es: Pedidos

source: Days Active
es: Días Activo

source: Quick Actions
es: Acciones Rápidas

source: My QR Codes
es: Mis Códigos QR

source: Scan History
es: Historial de Escaneos

source: My Orders
es: Mis Pedidos

source: Share Profile
es: Compartir Perfil

source: Export Data
es: Exportar Datos

# exportDataDescription
source: Download your QR codes and data
es: Descarga tus códigos QR y datos

source: Backup & Sync
es: Copia de Seguridad y Sincronización

# backupSyncDescription
source: Backup your data to cloud
es: Respalda tus datos en la nube

source: Privacy & Security
es: Privacidad y Seguridad

# privacySecurityDescription
source: Manage your privacy settings
es: Administra tu configuración de privacidad

source: Coming Soon
es: Próximamente

# featureComingSoon
source: {feature} will be available in a future update.
es: {feature} estará disponible en una futura actualización.

source: Saving...
es: Guardando...

source: Save
es: Guardar

# failedToUpdate
source: Failed to update {field}: {error}
es: Error al actualizar {field}: {error}

source: Sign Out
es: Cerrar Sesión

source: Settings
es: Configuración

source: Language
es: Idioma

source: English
es: Inglés

source: Spanish
es: Español

source: Close
es: Cerrar

source: Notifications
es: Notificaciones

# permissionDeniedTitle
source: {permissionType} Permission
es: Permiso de {permissionType}

source: Push notifications
es: Notificaciones push

source: Privacy
es: Privacidad

# dataPrivacySettings
source: Data and privacy settings
es: Configuración de datos y privacidad

source: Help & Support
es: Ayuda y Soporte

# helpSupportDescription
source: Get help and contact support
es: Obtén ayuda y contacta al soporte

# signOutConfirm
source: Are you sure you want to sign out of your account?
es: ¿Estás seguro de que quieres cerrar sesión en tu cuenta?

source: Signing out...
es: Cerrando sesión...

# signOutFailed
source: Failed to sign out. Please try again.
es: Error al cerrar sesión. Inténtalo de nuevo.

source: Select Photo Source
es: Seleccionar Fuente de Foto

# choosePhotoMethod
source: Choose how you want to add your photo
es: Elige cómo quieres agregar tu foto

source: Camera
es: Cámara

# takeNewPhoto
source: Take a new photo
es: Tomar una nueva foto

source: Gallery
es: Galería

source: Choose from photos
es: Elegir de las fotos

# failedToLoadProfile
source: Failed to load profile: {error}
es: Error al cargar perfil: {error}

# failedToUpdateProfile
source: Failed to update profile: {error}
es: Error al actualizar perfil: {error}

# failedToUpdateProfilePhoto
source: Failed to update profile photo: {error}
es: Error al actualizar foto de perfil: {error}

# cameraPermissionDenied
source: QRaft needs access to your camera to take photos for your profile picture. Please allow camera permission in your device settings.
es: QRaft necesita acceso a tu cámara para tomar fotos para tu imagen de perfil. Permite el acceso a la cámara en la configuración de tu dispositivo.

# galleryPermissionDenied
source: QRaft needs access to your photo library to select images for your profile picture. Please allow storage permission in your device settings.
es: QRaft necesita acceso a tu galería de fotos para seleccionar imágenes para tu imagen de perfil. Permite el acceso al almacenamiento en la configuración de tu dispositivo.

# imageSelectionCancelled
source: Image selection was cancelled.
es: Selección de imagen cancelada.

source: Retry
es: Reintentar

source: Crop Image
es: Recortar Imagen

source: Crop
es: Recortar

source: Cancel
es: Cancelar

source: Rotate Left
es: Rotar Izquierda

source: Rotate Right
es: Rotar Derecha

# cropInstruction
source: Adjust the crop area by dragging the corners
es: Ajusta el área de recorte arrastrando las esquinas

# cropFailed
source: Failed to crop image. Please try again.
es: Error al recortar imagen. Inténtalo de nuevo.

source: Processing image...
es: Procesando imagen...

source: QR Scanner
es: Escáner QR

# pointCameraAtQR
source: Point camera at QR code to scan
es: Apunta la cámara al código QR

source: Copy
es: Copiar

source: Clear All
es: Borrar todo

source: Clear All History
es: Borrar todo el historial

# clearAllHistoryConfirm
source: Are you sure you want to clear all scan history? This action cannot be undone.
es: ¿Estás seguro de que deseas borrar todo el historial?

source: No Scans Yet
es: Aún no hay escaneos

# startScanningToSeeHistory
source: Start scanning QR codes to see your history here
es: Comienza a escanear para ver el historial

source: Start Scanning
es: Comenzar a escanear

source: Create QR Code
es: Crear Código QR

# chooseQRType
source: Choose the type of QR code you want to create
es: Elige el tipo de código QR que quieres crear

# qrFormWebsiteUrl
source: Website URL
es: URL del Sitio Web

# qrFormWebsiteSubtitle
source: Create a QR code that opens a website
es: Crea un código QR que abra un sitio web

# urlFieldLabel
source: Website URL
es: URL del Sitio Web

# urlFieldPlaceholder
source: https://example.com
es: https://ejemplo.com

# continueButton
source: Continue
es: Continuar

# urlValidationEmpty
source: Please enter a URL
es: Por favor ingresa una URL

# urlValidationSpaces
source: URL cannot contain spaces
es: La URL no puede contener espacios

# urlValidationInvalid
source: Please enter a valid URL
es: Por favor ingresa una URL válida

# urlValidationDomain
source: Please enter a valid domain
es: Por favor ingresa un dominio válido

# customizeQR
source: Customize Your QR
es: Personaliza tu QR

# customizeQRSubtitle
source: Make your QR code unique
es: Haz único tu código QR

source: Foreground Color
es: Color Principal

source: Background Color
es: Color de Fondo

source: Eye Color
es: Color de Ojos

# qrSize
source: Size
es: Tamaño

source: Templates
es: Plantillas

source: Add Logo
es: Agregar Logo

source: Remove Logo
es: Quitar Logo

source: Preview
es: Vista Previa

source: Generate QR
es: Generar QR

# qrFormCompleteFields
source: Complete all fields correctly to continue
es: Completa todos los campos correctamente para continuar

# qrFormStepEnterInfo
source: Enter information
es: Ingresa información

# qrFormStepCustomize
source: Customize appearance
es: Personalizar apariencia

# qrFormStepPreviewSave
source: Preview & save
es: Vista previa y guardar

# qrFormButtonContinue
source: Continue
es: Continuar

# qrFormButtonPreview
source: Preview
es: Vista Previa

# qrFormButtonSave
source: Save QR Code
es: Guardar Código QR

# generateQRTitle
source: Generate QR
es: Generar QR

# generateQRSubtitle
source: Create QR codes for various purposes
es: Crea códigos QR para varios propósitos

source: Template Library
es: Biblioteca de Plantillas

# templateLibraryDescription
source: Browse pre-designed QR templates
es: Explora plantillas de QR prediseñadas

# qrTypePersonalInfo
source: Personal Info
es: Información Personal

# qrTypePersonalInfoDesc
source: Contact details vCard format
es: Detalles de contacto Formato vCard

# qrTypeWebsiteUrl
source: Website URL
es: URL del Sitio Web

# qrTypeWebsiteUrlDesc
source: Links to websites and web pages
es: Enlaces a sitios web y páginas web

# qrTypeWifi
source: WiFi Network
es: Red WiFi

# qrTypeWifiDesc
source: Share WiFi credentials easily
es: Comparte credenciales WiFi fácilmente

# qrTypeText
source: Text Message
es: Mensaje de Texto

# qrTypeTextDesc
source: Plain text content for any purpose
es: Contenido de texto plano para cualquier propósito

# qrTypeEmail
source: Email
es: Correo Electrónico

# qrTypeEmailDesc
source: Send email with pre-filled content
es: Envía correo con contenido pre-llenado

# qrTypeLocation
source: Location
es: Ubicación

# qrTypeLocationDesc
source: GPS coordinates and map points
es: Coordenadas GPS y puntos del mapa

# styleColors
source: Colors
es: Colores

source: Back to QR Types
es: Volver a Tipos de QR

source: Planned Features
es: Características Planificadas

# expectedInNextUpdate
source: Expected in next major update
es: Esperado en la próxima actualización mayor

# qrCodeSizeLabel
source: QR Code Size: {size}px
es: Tamaño del Código QR: {size}px

source: Logo Added
es: Logo Agregado

source: No Logo
es: Sin Logo

# logoDescription
source: Add a logo to personalize your QR
es: Agrega un logo para personalizar tu QR

# logoAddedDescription
source: Tap to change or remove
es: Toca para cambiar o quitar

# changeLogo
source: Change
es: Cambiar

# logoUpdateSuccess
source: Logo updated successfully!
es: ¡Logo actualizado exitosamente!

source: View Full Size
es: Ver Tamaño Real

# personalInfoFormTitle
source: Personal Information
es: Información Personal

# personalInfoFormSubtitle
source: Create a vCard with your contact information
es: Crea una vCard con tu información de contacto

# qrCodeNameLabel
source: QR Code Name *
es: Nombre del Código QR *

# qrCodeNameHint
source: My Contact Card
es: Mi Tarjeta de Contacto

source: First Name *
es: Nombre *

# firstNameHint
source: John
es: Juan

source: Last Name *
es: Apellido *

# lastNameHint
source: Doe
es: Pérez

source: Organization
es: Organización

# organizationHint
source: Acme Corporation
es: Corporación Acme

# emailHint
source: john@example.com
es: juan@ejemplo.com

# websiteHint
source: https://johndoe.com
es: https://juanperez.com

source: Address
es: Dirección

# addressHint
source: 123 Main St, City, State 12345
es: Calle 123, Ciudad, Estado 12345

source: Note
es: Nota

# noteHint
source: Additional information...
es: Información adicional...

# requiredFieldsMessage
source: Please fill in all required fields (*)
es: Por favor completa todos los campos requeridos (*)

source: Search country
es: Buscar país

# emailFormTitle
source: Email
es: Correo

# emailFormSubtitle
source: Create QR code for sending pre-filled email
es: Crear código QR para enviar correo pre-llenado

# emailQrNameHint
source: Email QR
es: QR de Correo

# emailRecipientLabel
source: Email Address *
es: Dirección de Correo *

# emailRecipientHint
source: recipient@example.com
es: destinatario@ejemplo.com

# emailSubjectLabel
source: Subject
es: Asunto

# emailSubjectHint
source: Email subject...
es: Asunto del correo...

# emailBodyLabel
source: Message
es: Mensaje

# emailBodyHint
source: Type your message here...
es: Escribe tu mensaje aquí...

source: WiFi Network Details
es: Detalles de la Red WiFi

# wifiFormDescription
source: Enter WiFi network details to create a QR code for easy sharing
es: Ingresa los detalles de la red WiFi para crear un código QR y compartirlo fácilmente

# networkNameLabel
source: Network Name (SSID) *
es: Nombre de Red (SSID) *

# networkNameHint
source: Enter WiFi network name
es: Ingresa el nombre de la red WiFi

# wifiPasswordLabel
source: Password *
es: Contraseña *

# wifiPasswordHint
source: Enter WiFi password
es: Ingresa la contraseña WiFi

source: Security Type
es: Tipo de Seguridad

# securityWpaRecommended
source: WPA/WPA2 (Recommended)
es: WPA/WPA2 (Recomendado)

# securityWepLegacy
source: WEP (Legacy)
es: WEP (Legado)

# securityOpenNetwork
source: Open Network (No Password)
es: Red Abierta (Sin Contraseña)

source: Hidden Network
es: Red Oculta

# hiddenNetworkDescription
source: Network name is not broadcasted publicly
es: El nombre de la red no se transmite públicamente

# networkNameRequired
source: Network name is required
es: El nombre de la red es requerido

# networkNameTooLong
source: Network name must be 32 characters or less
es: El nombre de la red debe tener 32 caracteres o menos

# passwordRequiredForSecuredNetworks
source: Password is required for secured networks
es: La contraseña es requerida para redes seguras

# passwordTooLong
source: Password must be 63 characters or less
es: La contraseña debe tener 63 caracteres o menos

# qrCodeSizeTitle
source: QR Code Size
es: Tamaño del Código QR

# sizeSmall
source: Small
es: Pequeño

# sizeMedium
source: Medium
es: Mediano

# sizeLarge
source: Large
es: Grande

# logoAddedTitle
source: Logo Added
es: Logo Agregado

# noLogoTitle
source: No Logo
es: Sin Logo

# logoWillAppearInCenter
source: Your logo will appear in the center of the QR code
es: Tu logo aparecerá en el centro del código QR

# addLogoToPersonalize
source: Add a logo to personalize your QR code
es: Agrega un logo para personalizar tu código QR

source: Remove
es: Quitar

source: Change
es: Cambiar

source: Complete form to see preview
es: Completa el formulario para ver la vista previa

source: Logo updated successfully!
es: ¡Logo actualizado exitosamente!

# failedToPickImage
source: Failed to pick image: {error}
es: Error al seleccionar imagen: {error}

# locationFormTitle
source: Location Details
es: Detalles de Ubicación

# locationFormDescription
source: Share your location or any GPS coordinates with a QR code
es: Comparte tu ubicación o cualquier coordenada GPS con un código QR

# locationNameLabel
source: Location Name
es: Nombre de Ubicación

# locationNameHint
source: My Location
es: Mi Ubicación

# locationNameRequired
source: Location name is required
es: El nombre de ubicación es requerido

# locationNameTooShort
source: Location name must be at least 2 characters
es: El nombre de ubicación debe tener al menos 2 caracteres

# latitudeLabel
source: Latitude *
es: Latitud *

# longitudeLabel
source: Longitude *
es: Longitud *

source: Use Current Location
es: Usar Ubicación Actual

source: Pick from Map
es: Seleccionar del Mapa

source: Location Options
es: Opciones de Ubicación

source: Manual Entry
es: Entrada Manual

# manualEntryDesc
source: Enter coordinates manually
es: Introducir coordenadas manualmente

# currentLocationDesc
source: Use device GPS location
es: Usar ubicación GPS del dispositivo

# mapLocationDesc
source: Select point on interactive map
es: Seleccionar punto en mapa interactivo

# latitudeRequired
source: Latitude is required
es: La latitud es requerida

# longitudeRequired
source: Longitude is required
es: La longitud es requerida

# latitudeInvalid
source: Please enter a valid latitude (-90 to 90)
es: Por favor ingresa una latitud válida (-90 a 90)

# longitudeInvalid
source: Please enter a valid longitude (-180 to 180)
es: Por favor ingresa una longitud válida (-180 a 180)

# locationPermissionRequired
source: Location permission is required to use current location
es: Se requiere permiso de ubicación para usar la ubicación actual

# locationServiceDisabled
source: Location services are disabled. Please enable them in settings
es: Los servicios de ubicación están deshabilitados. Por favor habilitarlos en configuración

source: Getting current location...
es: Obteniendo ubicación actual...

# locationObtained
source: Location obtained successfully!
es: ¡Ubicación obtenida exitosamente!

# failedToGetLocation
source: Failed to get current location: {error}
es: Error al obtener ubicación actual: {error}

source: Select Location on Map
es: Seleccionar Ubicación en el Mapa

# tapMapToSelectLocation
source: Tap on the map to select a location
es: Toca en el mapa para seleccionar una ubicación

source: Confirm Location
es: Confirmar Ubicación

source: Selected Location
es: Ubicación Seleccionada

source: Current location found
es: Ubicación actual encontrada

# usingDefaultLocation
source: Using default location - tap to select
es: Usando ubicación predeterminada - toca para seleccionar

# useCurrent
source: Use Current Location
es: Usar Ubicación Actual

# mapLoadingError
source: Failed to load map. Please check your internet connection
es: Error al cargar el mapa. Por favor verifica tu conexión a internet

source: QR Library
es: Biblioteca QR

# manageQRCodes
source: Manage your QR codes
es: Gestiona tus códigos QR

source: My QRs
es: Mis QRs

source: Favorites
es: Favoritos

source: Recent
es: Recientes

source: This Month
es: Este Mes

source: No QR Codes Yet
es: Aún No Hay Códigos QR

# createFirstQRCode
source: Create your first QR code to see it here
es: Crea tu primer código QR para verlo aquí

source: No QR Codes Found
es: No Se Encontraron Códigos QR

source: Clear Filters
es: Limpiar Filtros

# tryDifferentSearchTerm
source: Try a different search term
es: Intenta con otro término de búsqueda

# filterAll
source: All
es: Todos

# filterLocation
source: Location
es: Ubicación

# filterText
source: Text
es: Texto

source: No Favorites Yet
es: Aún No Hay Favoritos

# starFavoriteQRCodes
source: Star your favorite QR codes to see them here
es: Marca con estrella tus códigos QR favoritos para verlos aquí

source: No Recent QRs
es: No Hay QRs Recientes

# recentQRCodesAppearHere
source: Your recently created QR codes will appear here
es: Tus códigos QR creados recientemente aparecerán aquí

source: Search QR Codes
es: Buscar Códigos QR

# searchByNameTypeContent
source: Search by name, type, or content...
es: Buscar por nombre, tipo o contenido...

source: Search
es: Buscar

# searchFunctionalityComingSoon
source: Search functionality will be implemented soon
es: La funcionalidad de búsqueda se implementará pronto

source: Edit
es: Editar

source: Delete
es: Eliminar

source: Share
es: Compartir

source: Delete QR Code
es: Eliminar Código QR

# deleteQRConfirmation
source: Are you sure you want to delete "{name}"? This action cannot be undone.
es: ¿Estás seguro de que quieres eliminar "{name}"? Esta acción no se puede deshacer.

# addedToFavorites
source: Added "{name}" to favorites!
es: ¡"{name}" agregado a favoritos!
