Repository: fricred/QRaft
Catalog: lib/l10n/app_*.arb
Languages: es

# removedFromFavorites
source: Removed "{name}" from favorites
es: "{name}" eliminado de favoritos

# failedToUpdateFavorite
source: Failed to update favorite: {error}
es: Error al actualizar favorito: {error}

# sharingQRCode
source: Sharing "{name}" QR code...
es: Compartiendo código QR "{name}"...

# editFunctionalityComingSoon
source: Edit functionality for "{name}" coming soon!
es: ¡La funcionalidad de edición para "{name}" llegará pronto!

# deletedSuccessfully
source: "{name}" deleted successfully
es: "{name}" eliminado exitosamente

# failedToDeleteQRCode
source: Failed to delete QR code: {error}
es: Error al eliminar código QR: {error}

# shareFunctionalityComingSoon
source: Share functionality will be implemented soon
es: La funcionalidad de compartir se implementará pronto

source: Just now
es: Ahora mismo

# minutesAgo
source: {minutes}m ago
es: hace {minutes}m

# hoursAgo
source: {hours}h ago
es: hace {hours}h

# daysAgoShort
source: {days}d ago
es: hace {days}d

source: Type
es: Tipo

source: Edit Profile
es: Editar Perfil

source: Save Changes
es: Guardar Cambios

source: Discard changes?
es: ¿Descartar cambios?

# discardChangesMessage
source: You have unsaved changes. Are you sure you want to discard them?
es: Tienes cambios sin guardar. ¿Estás seguro de que quieres descartarlos?

source: Keep Editing
es: Seguir Editando

source: Discard
es: Descartar

source: PERSONAL DETAILS
es: DATOS PERSONALES

# workAndSocial
source: WORK & SOCIAL
es: TRABAJO Y REDES

# profileUpdatedSuccess
source: Profile updated successfully
es: Perfil actualizado exitosamente

# enterDisplayName
source: Enter your name
es: Ingresa tu nombre

# enterBio
source: Tell us about yourself...
es: Cuéntanos sobre ti...

# enterLocation
source: City, Country
es: Ciudad, País

# enterCompany
source: Your company name
es: Nombre de tu empresa

# enterJobTitle
source: Your job title
es: Tu puesto de trabajo

# dashboardTitle
source: Dashboard
es: Inicio

source: Scanner
es: Escáner

# libraryNav
source: Library
es: Biblioteca

# marketplaceNav
source: Marketplace
es: Tienda

source: Recent QR Codes
es: QR Recientes

source: View All
es: Ver Todo

source: Create QR
es: Crear QR

# createQRDescription
source: Generate new QR code
es: Generar nuevo código QR

# scanQRAction
source: Scan QR
es: Escanear QR

# scanQRDescription
source: Open camera scanner
es: Abrir escáner de cámara

# myLibraryAction
source: My Library
es: Mi Biblioteca

# myLibraryDescription
source: View saved QR codes
es: Ver códigos QR guardados

# marketplaceAction
source: Marketplace
es: Tienda

# marketplaceDescription
source: Order laser engraving
es: Ordenar grabado láser

source: View Profile
es: Ver Perfil

source: Camera Unavailable
es: Cámara No Disponible

source: Initializing Camera...
es: Inicializando Cámara...

# tapToScan
source: Tap the scan button to start detecting QR codes
es: Toca el botón de escanear para detectar códigos QR

# cameraInitFailed
source: Camera initialization failed
es: Error al inicializar la cámara

# noCameraAvailable
source: No camera available. Please use a physical device to scan QR codes.
es: No hay cámara disponible. Por favor usa un dispositivo físico para escanear códigos QR.

# cameraPermissionDeniedMessage
source: Camera permission denied. Please enable in Settings.
es: Permiso de cámara denegado. Por favor habilítalo en Configuración.

source: Camera error
es: Error de cámara

# openSettings
source: Settings
es: Configuración

# dismissButton
source: Dismiss
es: Cerrar

# failedToOpenSettings
source: Failed to open app settings: {error}
es: Error al abrir configuración: {error}

source: Edit QR Code
es: Editar Código QR

# formTab
source: Form
es: Formulario

# styleTab
source: Style
es: Estilo

# saveChangesBtn
source: Save Changes
es: Guardar Cambios

source: Customize your QR
es: Personaliza tu QR

# qrColorLabel
source: QR Color
es: Color del QR

# backgroundLabel
source: Background
es: Fondo

# eyeColorLabel
source: Eye Color
es: Color de Ojos

# qrSavedSuccess
source: QR code "{name}" saved successfully!
es: ¡Código QR "{name}" guardado exitosamente!

# qrUpdatedSuccess
source: QR code "{name}" updated successfully!
es: ¡Código QR "{name}" actualizado exitosamente!

# failedToSaveQR
source: Failed to save QR code: {error}
es: Error al guardar código QR: {error}

# wifiQrUpdatedSuccess
source: WiFi QR code "{name}" updated successfully!
es: ¡Código QR WiFi "{name}" actualizado exitosamente!

# wifiQrSavedSuccess
source: WiFi QR code "{name}" saved successfully!
es: ¡Código QR WiFi "{name}" guardado exitosamente!

# colorsSection
source: Colors
es: Colores

# sizeSection
source: Size
es: Tamaño

# textMessageTitle
source: Text Message
es: Mensaje de Texto

# textFormDescription
source: Enter any text you want to share via QR code
es: Ingresa cualquier texto que quieras compartir vía código QR

# textContentLabel
source: Text Content
es: Contenido de Texto

# textContentHint
source: Enter your message...
es: Escribe tu mensaje...

source: Text Information
es: Información del Texto

source: Characters: {count}
es: Caracteres: {count}

# charStatusEmpty
source: Empty
es: Vacío

# charStatusOptimal
source: Optimal
es: Óptimo

# charStatusGood
source: Good
es: Bueno

# charStatusLarge
source: Large
es: Grande

# pleaseEnterText
source: Please enter your text
es: Por favor ingresa tu texto

# textTooLong
source: Text is too long (max {max} characters)
es: El texto es muy largo (máximo {max} caracteres)

# qrNameRequired
source: Please enter a name for your QR code
es: Por favor ingresa un nombre para tu código QR

# qrNameTooShort
source: Name must be at least 2 characters
es: El nombre debe tener al menos 2 caracteres

# qrNameTooLong
source: Name is too long (max {max} characters)
es: El nombre es muy largo (máximo {max} caracteres)

# qrCodeNameFieldLabel
source: QR Code Name
es: Nombre del Código QR

source: My Text Message
es: Mi Mensaje de Texto

source: Preview: {text}
es: Vista previa: {text}

# emailAddressRequired
source: Email address is required
es: La dirección de correo es requerida

# invalidEmailFormat
source: Please enter a valid email address
es: Por favor ingresa una dirección de correo válida

# contactsPermissionRequired
source: Contacts permission is required to import email addresses
es: Se requiere permiso de contactos para importar direcciones de correo

# noContactsWithEmail
source: No contacts with email addresses found
es: No se encontraron contactos con direcciones de correo

# contactImportedSuccess
source: Contact email imported successfully!
es: ¡Correo del contacto importado exitosamente!

source: Failed to import contact
es: Error al importar contacto

# contactsPermissionDenied
source: Contacts permission denied. Please enable it in device settings.
es: Permiso de contactos denegado. Por favor habilítalo en la configuración del dispositivo.

# contactsNotAvailable
source: Contact access is not available on this device.
es: El acceso a contactos no está disponible en este dispositivo.

source: Select Contact Email
es: Seleccionar Correo de Contacto

source: Unknown Contact
es: Contacto Desconocido

# enterWebsiteURL
source: Enter the website URL you want to share
es: Ingresa la URL del sitio web que quieres compartir

# protocolAutoAdded
source: Protocol (https://) will be added automatically
es: El protocolo (https://) se agregará automáticamente

source: My Website
es: Mi Sitio Web

# qrNameHelp
source: This name will help you identify your QR code
es: Este nombre te ayudará a identificar tu código QR

# fillFormToPreview
source: Fill in the form to see preview
es: Completa el formulario para ver la vista previa

source: Valid URL examples:
es: Ejemplos de URLs válidas:

source: Please enter your name
es: Por favor ingresa tu nombre

# nameTooLong
source: Name is too long
es: El nombre es muy largo

# locationTitle
source: Location
es: Ubicación

# shareGPSCoordinates
source: Share GPS coordinates and map points
es: Comparte coordenadas GPS y puntos del mapa

# comingSoonTitle
source: Coming Soon!
es: ¡Próximamente!

# locationQrComingSoon
source: Location QR generator is under development and will be available soon.
es: El generador de QR de ubicación está en desarrollo y estará disponible pronto.

# wifiQrComingSoon
source: WiFi QR generator is under development and will be available soon.
es: El generador de QR WiFi está en desarrollo y estará disponible pronto.

# firstNameRequired
source: First name is required
es: El nombre es requerido

# lastNameRequired
source: Last name is required
es: El apellido es requerido

# invalidPhoneNumber
source: Please enter a valid phone number
es: Por favor ingresa un número de teléfono válido

# softwareDeveloperHint
source: Software Developer
es: Desarrollador de Software

# searchQRCodesTitle
source: Search QR Codes
es: Buscar Códigos QR

# searchPlaceholder
source: Search by name, type, or content...
es: Buscar por nombre, tipo o contenido...

# searchComingSoon
source: Search functionality will be implemented soon
es: La funcionalidad de búsqueda se implementará pronto

# editQRCodeTitle
source: Edit QR Code
es: Editar Código QR

# editTypeName
source: Edit {type} QR Codes
es: Editar Códigos QR de {type}

# editNotSupported
source: Coming soon! Currently only URL and Text QR codes can be edited.
es: ¡Próximamente! Actualmente solo se pueden editar códigos QR de URL y Texto.

# backButton
source: Back
es: Atrás

source: QR Code Details
es: Detalles del Código QR

source: QR Content
es: Contenido del QR

# createdLabel
source: Created
es: Creado

# lastUpdatedLabel
source: Last Updated
es: Última Actualización

source: Copy Data
es: Copiar Datos

# deletingBtn
source: Deleting...
es: Eliminando...

source: Copied to clipboard
es: Copiado al portapapeles

# editVCardComingSoon
source: Editing vCard QR codes is coming soon
es: La edición de códigos QR vCard estará disponible pronto

# editWifiComingSoon
source: Editing WiFi QR codes is coming soon
es: La edición de códigos QR WiFi estará disponible pronto

# editEmailComingSoon
source: Editing Email QR codes is coming soon
es: La edición de códigos QR de correo estará disponible pronto

# editLocationComingSoon
source: Editing Location QR codes is coming soon
es: La edición de códigos QR de ubicación estará disponible pronto

# editTypeNotSupported
source: Editing {type} QR codes is not supported yet
es: La edición de códigos QR de {type} aún no está soportada

# qrDeletedSuccess
source: QR code deleted successfully
es: Código QR eliminado exitosamente

# failedToDeleteQR
source: Failed to delete QR code: {error}
es: Error al eliminar código QR: {error}

# todayAt
source: Today at {time}
es: Hoy a las {time}

# yesterdayAt
source: Yesterday at {time}
es: Ayer a las {time}

# daysAgoFormat
source: {days} days ago
es: Hace {days} días

# downloadQRData
source: Download your QR codes and data
es: Descarga tus códigos QR y datos

# backupToCloud
source: Backup your data to cloud
es: Respalda tus datos en la nube

# managePrivacy
source: Manage your privacy settings
es: Administra tu configuración de privacidad

# savingBtn
source: Saving...
es: Guardando...

# openSettingsMessage
source: Open Settings > {section} > {title} to enable access.
es: Abre Configuración > {section} > {title} para habilitar el acceso.

source: In Stock
es: En Stock

source: Out of Stock
es: Agotado

# defaultProductDescription
source: High-quality laser-engraved product with your custom QR code.
es: Producto grabado con láser de alta calidad con tu código QR personalizado.

source: Customization
es: Personalización

source: Select Size
es: Seleccionar Tamaño

source: Select Finish
es: Seleccionar Acabado

# productGallery
source: Gallery
es: Galería

# galleryFrontView
source: Front View
es: Vista Frontal

# gallery3DPreview
source: 3D Preview
es: Vista 3D

# galleryWithQRCode
source: With QR Code
es: Con Código QR

source: Features
es: Características

# featurePrecisionEngraving
source: Precision laser engraving
es: Grabado láser de precisión

# featureHighQuality
source: High-quality
es: Alta calidad

# featureCustomQRDesign
source: Custom QR code design
es: Diseño de código QR personalizado

# featureDurable
source: Durable and long-lasting
es: Duradero y resistente

source: Add to Cart
es: Agregar al Carrito

source: Added!
es: ¡Agregado!

source: added to cart!
es: agregado al carrito!

source: View Cart
es: Ver Carrito

# errorAddingToCart
source: Error adding to cart. Please try again.
es: Error al agregar al carrito. Inténtalo de nuevo.
